# Multivarete Iterative Imputation by Chained Imputation  -->MICE

can apply on only the input columns not on the output columns

In [2]:
import pandas as pd 
import numpy as  np

In [44]:
# explicitly require this experimental feature
from sklearn.experimental import enable_iterative_imputer  # noqa
# now you can import normally from impute
from sklearn.impute import IterativeImputer

In [19]:
df = np.round(pd.read_csv('dataset\Startups.csv')[['R&D Spend','Administration','Marketing Spend','Profit']]/10000)

In [21]:
df.shape

(50, 4)

In [20]:
X= df.drop(columns=['Profit'])
Y=df['Profit']

In [38]:
# Set a random seed for reproducibility
np.random.seed(9)

# Replace random values with NaN
for col in X.columns:
    X.loc[X.sample(frac=0.2, random_state=9).index, col] = np.nan  # 20% random NaNs per column

In [43]:
X.sample(5)

    R&D Spend  Administration  Marketing Spend
12        9.0            13.0             25.0
1        16.0            15.0             44.0
25        NaN             NaN              NaN
0        17.0            14.0             47.0
21        NaN             NaN              NaN

In [53]:
mice =IterativeImputer(max_iter=30 )

X_trf = mice.fit_transform(X)

In [54]:
X_trf = pd.DataFrame(X_trf ,columns=X.columns)

In [55]:
X_trf.head()

   R&D Spend  Administration  Marketing Spend
0      17.00           14.00            47.00
1      16.00           15.00            44.00
2       7.05           12.05            20.65
3      14.00           12.00            38.00
4      14.00            9.00            37.00

In [48]:
X.head()

   R&D Spend  Administration  Marketing Spend
0       17.0            14.0             47.0
1       16.0            15.0             44.0
2        NaN             NaN              NaN
3       14.0            12.0             38.0
4       14.0             9.0             37.0

In [49]:
df.head()

   R&D Spend  Administration  Marketing Spend  Profit
0       17.0            14.0             47.0    19.0
1       16.0            15.0             44.0    19.0
2       15.0            10.0             41.0    19.0
3       14.0            12.0             38.0    18.0
4       14.0             9.0             37.0    17.0

In [62]:
df = np.round(pd.read_csv('dataset\Startups.csv')[['R&D Spend','Administration','Marketing Spend','Profit']]/10000)

In [69]:
X1= df.drop(columns=['Profit'])
Y=df['Profit']

In [70]:
for index, row in X1.iterrows():
    columns = list(X1.columns)
    
    # Check if there's a middle column
    middle_index = len(columns) // 2
    middle_col = columns[middle_index]
    
    # Randomly decide whether to replace middle or another column
    if np.random.rand() > 0.5:
        # Replace middle column with NaN
        X1.at[index, middle_col] = np.nan
    else:
        # Replace a random column other than middle
        other_cols = [col for col in columns if col != middle_col]
        random_col = np.random.choice(other_cols)
        X1.at[index, random_col] = np.nan

In [77]:
X1.head(5)

   R&D Spend  Administration  Marketing Spend
0       17.0             NaN             47.0
1        NaN            15.0             44.0
2       15.0             NaN             41.0
3       14.0            12.0              NaN
4       14.0             NaN             37.0

In [73]:
mice1= IterativeImputer(max_iter=12)
X_trf1=mice.fit_transform(X1)

In [75]:
X_trf1 = pd.DataFrame(X_trf1 ,columns=X1.columns)

In [76]:
X_trf1.head()

   R&D Spend  Administration  Marketing Spend
0   17.00000       12.212457        47.000000
1   14.34837       15.000000        44.000000
2   15.00000       12.202670        41.000000
3   14.00000       12.000000        33.278135
4   14.00000       12.196404        37.000000

In [78]:
df.head()

   R&D Spend  Administration  Marketing Spend  Profit
0       17.0            14.0             47.0    19.0
1       16.0            15.0             44.0    19.0
2       15.0            10.0             41.0    19.0
3       14.0            12.0             38.0    18.0
4       14.0             9.0             37.0    17.0

In [79]:
from sklearn.impute import SimpleImputer

In [80]:
si =SimpleImputer()
X_si =si.fit_transform(X1)

In [81]:
X_si =pd.DataFrame(X_si,columns=X1.columns)
X_si.head()

   R&D Spend  Administration  Marketing Spend
0  17.000000       12.166667        47.000000
1   7.648649       15.000000        44.000000
2  15.000000       12.166667        41.000000
3  14.000000       12.000000        20.282051
4  14.000000       12.166667        37.000000